/*
某公司有四个销售员(代号1—4)，负责销售五种产品(代号1—5)。每个销售员都把当天售出的每种产品各写一张便条交上来。每张便条包含销售员的代号、产品的代号、这种产品的销售额。我们搜集到了每个月的所有便条，你的任务是根据这些便条，计算出每人、每种产品的总销售额。处理完销售信息后，以表格形式打印出结果。用列代表销售员，行代表产品。每种产品的销售总额输出到该行的最右边，每个销售员的销售总额输出到该列的最下边。

输入格式:
共n+1行，第一行为一个整数n，代表便条的数量，然后是n组便条的内容，每组内容包括两个整数和一个浮点数，即销售员的代号、产品的代号、这种产品的销售额。具体见样例。

输出格式:
信息处理后的矩阵，为一个6行，5列的矩阵，矩阵元素保留一位小数。每行的每个元素用tab分隔，注意每行最后一个数的后面为换行符。输出格式细节见样例。

特别提醒：题目作者存储浮点数数据的二维数组用的是 float类型。

输入样例:
4
1 1 35.6
1 2 23.1
1 1 89.3
4 5 22.6
 

输出样例:
124.9	0.0	0.0	0.0	124.9
23.1	0.0	0.0	0.0	23.1
0.0	0.0	0.0	0.0	0.0
0.0	0.0	0.0	0.0	0.0
0.0	0.0	0.0	22.6	22.6
148.0	0.0	0.0	22.6	170.6
*/

#include<stdio.h>
 
int main()
{
    int n,a,b;
    float c,sum=0;
    scanf("%d",&n);
    float arr[6][5]={0};
    for(int i=0;i<n;i++)
    {
        scanf("%d %d %f",&a,&b,&c);
        arr[b-1][a-1]+=c;
    }
    for(int i=0;i<5;i++)
    {
        for(int j=0;j<4;j++)
            arr[i][4]+=arr[i][j];
    }
    for(int i=0;i<5;i++)
    {
        for(int j=0;j<5;j++)
            sum+=arr[j][i];
        arr[5][i]=sum;
        sum=0;
    }
    for(int i=0;i<6;i++)
    {
        for(int j=0;j<4;j++)
            printf("%.1f\t",arr[i][j]);
        printf("%.1f\n",arr[i][4]);
    }
 
    return 0;
}