/*​
斐波那契数列（Fibonacci sequence），又称黄金分割数列，因数学家莱昂纳多·斐波那契（Leonardo Fibonacci）以兔子繁殖为例子而引入，故又称为“兔子数列”。它指的是这样一个数列 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233，377，610，987，1597，2584，4181，6765，10946，17711，28657，46368……..这个数列从第3项开始，每一项都等于前两项之和。
现请你写一个程序计算这个数列的第n项值除以101的余数。

输入格式:
只有一行，为一个正整数n(3<=n<=100000000)。

输出格式:
也只有一行，为一个正整数，代表斐波那契数列第n项的值除以101的余数。

输入样例:
38

输出样例:
58
*/

#include<stdio.h>

long long FBNQ(long long n)
{
    long long a=1,b=1,c=0;
    for(int i=3;i<=n;i++)//直接对101取余，防止数太大导致无法正常存储
    {
        c=(a+b);
        a=b%101;
        b=c%101;
    }
    return b;
}

int main()
{
    long long n,result;
    scanf("%lld",&n);
    if(n>=3&&n<=100000000)
    {
        result=FBNQ(n);
        printf("%lld",result);
    }

    return 0;
}